

Once that is complete it is going to give you some links. The app is NOT going to work yet it is only going to show you the code inside of your index.js file. You need to create a vercel.json file and put it in the root folder so that Vercel knows that it is a Node application. And it is very important that your index.js file remains in the root folder along with your other server side code for the project otherwise your app won't work.

Create a vercel.json file and put it in the root of your project folder and then add the code below
{
    "version": 2,
    "builds": [
        {
            "src": "./index.js",
            "use": "@vercel/node"
        }
    ],
    "routes": [
        {
            "src": "/(.*)",
            "dest": "/"
        }
    ]
}
Now run the command vercel again to deploy your app. Open the Production link and your app should be working online with full working routes.

Top comments (35)

Subscribe
pic
Add to the discussion
 
 
saadabbasi profile image
Saad Abbasi
•
May 28 '21

not working , getting this error Due tobuildsexisting in your configuration file, the Build and Development Settings defined in your Project Settings will not apply. Learn More: https://vercel.link/unused-build-settings


7
Like
 
 
priyang_bawa profile image
⚡Priyang⚡
•
Apr 14

You have to remove build script from your package.json file


1
Like
 
 
chromeowo profile image
Chrome#4181
•
Oct 26 '21

yeah, Any solution?


1
Like
 
 
schalkneethling profile image
Schalk Neethling
•
Feb 28

Thank you for the post! I think the final paragraph is missing one last line. While the vercel CLI will output this, some folks might miss it. Running vercel will give you a preview deploy URL to test.

If you are happy with the result, run vercel --prod to deploy to the production URL.


3
Like
 
 
nerkar_krish profile image
Krish Nerkar
•
Mar 30 '21

how to set the port in vercel for it to know which port to serve the app on


1
Like
 
 
andrewbaisden profile image
Andrew Baisden
•
Apr 2 '21

Hi I am not sure what you mean I think Vercel assigns a default port that can't be changed. However you can use whatever port you want locally.


2
Like
 
 
nerkar_krish profile image
Krish Nerkar
•
Apr 2 '21

What port does it assign by default, like what should I set here app.listen(8000, ()=> {
console.log("app started")
})


1
Like
Thread
 
andrewbaisden profile image
Andrew Baisden
•
Apr 2 '21 • Edited on

I think it uses port 3000. But regardless if you use the below it should be fine. The code process.env.PORT means that whatever is in the environment variable PORT, on Vercel's end gets assigned as the port number. Otherwise it uses 3000 or whatever port number you put there.
const port = process.env.PORT || 3000;

2
Like
Thread
 
nerkar_krish profile image
Krish Nerkar
•
Apr 2 '21

I tried it, but dosent work, just gives me a 404 page on vercel


2
Like
Thread
 
andrewbaisden profile image
Andrew Baisden
•
Apr 2 '21

Hmm is your operating system Linux? Linux is not well supported by Vercel when using this method.


2
Like
Thread
 
nerkar_krish profile image
Krish Nerkar
•
Apr 2 '21

Nope, I'm using plain windows, but I just can't get the app running on vercel for some reason, it's working perfectly well on localhost and even zeet.co (as you have an option to set a port to listen on) but can't figure out vercel

Do you have some github repo or anything which u can link which successfully deploys an express app to vercel


1
Like
Thread
 
andrewbaisden profile image
Andrew Baisden
•
Apr 2 '21

Here Vercel Node App


1
Like
Thread
 
nerkar_krish profile image
Krish Nerkar
•
Apr 8 '21

I checked it out and tried to recreate it but with my app, but still no success :(

here's the repo, if you can point out what mistake i am making : github.com/Krish-Nerkar/genzmafia....


1
Like
 
 
fzn0x profile image
Fauzan
•
Jan 24 • Edited on

UPDATE: If you getting error Due tobuildsexisting in your configuration file, the Build and Development Settings defined in your Project Settings will not apply. Learn More: https://vercel.link/unused-build-settings, change the vercel.json to
{
  "rewrites": [{ "source": "/(.*)", "destination": "/api" }]
}
See vercel.com/guides/using-express-wi...


1
Like
 
 
akkuldeep profile image
Rutik
•
Jul 13 '21

This Works Fine for Me with path.resolve(). Thanks !!

{
"builds": [
{
"src": "./app.js",
"use": "@vercel/node"
}
],
"routes": [
{
"src": "/(.*)",
"dest": "/app.js"
}
]
}


2
Like
 
 
sibteali786 profile image
Syed_Sibteali_Baqar
•
Sep 7 • Edited on

Thanks for the tutorial. Everythings working fine for me first time but when i connect my repository with this deployment and then push new changes, new deployment has white screen and nothing works. Thanks for helping


1
Like
 
 
andrewbaisden profile image
Andrew Baisden
•
Sep 10

Hey, this has become deprecated Vercel recommends that everybody uses Serverless Functions now. Follow the documentation and you should be able to get it working. I don't have a tutorial on it yet.

Supported Languages for Serverless Functions


1
Like
 
 
tasosy2k profile image
LeanDev
•
Oct 14 '20

Doesn't work, i have the bare minimum express app with the exact vercel config as you


1
Like
 
 
krehwell profile image
krehwell
•
Mar 7 '21 • Edited on

hey there. after you save the last script vercel.json run command vercel --prod instead of just vercel command as the author says. it works for me


1
Like
 
 
andrewbaisden profile image
Andrew Baisden
•
Oct 14 '20

Hey I just tried it and it's still working. What is your operating system and which browser did you try it in? Are you sure that you followed all of the steps what errors did you get?


1
Like
 
 
tasosy2k profile image
LeanDev
•
Oct 15 '20

Hello, im on linux mint 20, node 12.18.3, chrome 85.0.4183.121. I don't get any erros per se but the deployment page displays my source code as if it was on a directory listing instead of running it


1
Like
Thread
 
andrewbaisden profile image
Andrew Baisden
•
Oct 15 '20

Ok I think that its likely a Linux issue because I have another Vercel guide that uses Python and a few people had problems getting it to work on Linux as well How to deploy a Python/Flask App to Vercel The system architecture is different so I think it changes the paths. You could check out the docs here vercel.com/docs or find a solution on google. If I had Linux I would be able to debug it.


1
Like
Thread
 
tasosy2k profile image
LeanDev
•
Oct 15 '20

Alright i'll look it up, thanks for the help!


1
Like
 
 
chloe0307 profile image
Chloé Cuny
•
Dec 14 '20 • Edited on

Bonjour à tous,
Je suis sous Linux, et j'ai crée un projet node/express que j'aimerais déployer sur Vercel. J'ai suivi toutes vos recommandations mais rien à faire, ça m'affiche uniquement l'architecture de mon projet mais pas le résultat final ...
Quelqu'un aurait une idée?


1
Like
 
 
andrewbaisden profile image
Andrew Baisden
•
Dec 17 '20

Hé là, je crois que c'est parce que Vercel ne prend pas entièrement en charge Linux lors de l'utilisation de cette méthode. L'utilisation des fonctions sans serveur est une solution possible, mais je ne l'ai pas encore essayée. vercel.com/docs/serverless-functio...


1
Like
 
 
zippytyro profile image
Shashwat Verma
•
Oct 31 '20

I also faced one more problem as I was using templating engines. read the docs, it doesn't perfectly support EJS.


2
Like
 
 
andrewbaisden profile image
Andrew Baisden
•
Nov 16 '20

Using serverless functions could be a solution vercel.com/docs/serverless-functio...

However you can get it working with normal html files.

1 - Create a folder in the root directory called views and put an index.html file inside of it.

2 - Add the code below to your index.js file
const path = require('path');

app.get('/', (req, res) => {
    res.sendFile(path.join(__dirname + '/views/index.html'));
});
Now you can use html pages for your routes.


4
Like
 
 
krankj profile image
Sudarshan K J
•
Nov 10 '20 • Edited on

Thank you so much for this! It works effortlessly. To include the vercel.json file was not known to me earlier


2
Like
 
 
erickvh_ profile image
Erick Ventura
•
Oct 31 '20

Thanks you help me a lot


2
Like
 
 
edgaremmanuel profile image
DevByJESUS
•
May 13 '21

I am on linux , but everything worked fine for me , thanks man


2
Like
 
 
jord profile image
Jordan Turner
•
Sep 12 '21

Okay so now how to integrate a vercel database?


1
Like
 
 
andrewbaisden profile image
Andrew Baisden
•
Sep 10

Hey, this has become deprecated Vercel recommends that everybody uses Serverless Functions now. Follow the documentation and you should be able to get it working. I don't have a tutorial on it yet.

Supported Languages for Serverless Functions


1
Like
 
 
zippytyro profile image
Shashwat Verma
•
Oct 31 '20

thanks, a lot. I'm not just having a problem with static assets.
I've kept my assets/images in the public folder but that doesn't work.
please provide me a solution.


1
Like
 
 
andrewbaisden profile image
Andrew Baisden
•
Nov 16 '20 • Edited on

Do the following to get images working.

1 - Create a folder called public and put it in the root directory

2 - Add these lines to your index.js file
const path = require('path');

app.use('/static', express.static(path.join(__dirname + '/public')));
3 - Put some images in the public folder I will use cyberpunk.png as an example

4 - See localhost and Vercel link examples below. Change the port, username and images to suit your needs.

localhost:3000/static/cyberpunk.png

vercel-node-app.yourusername.verce...


3
Like
 
 
kalanzans profile image
Kal An Zans
•
Apr 20 '21

Fantastic! Thank YOU! :^)


1
Like
View full discussion (35 comments)
Code of Conduct • Report abuse
🌚 Friends don't let friends browse without dark mode.
Just kidding, it's a personal preference. But you can change your theme, font, etc. in your settings.

The more you know. 🌈

Read next
pmaidens profile image
The Future of Blogging: How AI is Changing the Industry
Peter Maidens - Dec 22

gauravkrp profile image
Add Snow to Your Website with Snowify: 2 lines of JavaScript
Gaurav Pandey - Dec 22

karvozavr profile image
The Four Horsemen of Software Complexity — Architecture Decision Records to the Rescue
Dmitrii Abramov - Dec 22

turupawn profile image
Explorer les contrats intelligents de Sudoswap
Ahmed Castro - Dec 22


Andrew Baisden
Follow
⚛️ Software Developer @CGI_Global | 🌅 Technical Writer @ThePracticalDev @hashnode @Medium @LogRocket | 🎨 Content Creator | 📝 5k+ Blog Subscribers
LOCATION
London, UK
EDUCATION
Bachelor Degree Computer Science
WORK
Software Developer @CGI
JOINED
Feb 11, 2020
More from Andrew Baisden
How to setup HarperDB on Ubuntu
#webdev #beginners #database #linux
Twitter is shutting down Revue their newsletter platform
#news #watercooler #productivity #codenewbie
A day in the life of a developer
#watercooler #career #writing #codenewbie
{
    "version": 2,
    "builds": [
        {
            "src": "./index.js",
            "use": "@vercel/node"
        }
    ],
    "routes": [
        {
            "src": "/(.*)",
            "dest": "/"
        }
    ]
}